"""
==============================================================================
Project: 페토이 기본 코드 정리

File: 12_camera.py
Summary: AI 비전 카메라 예제
Author: 유도연
Created Date: 2025-10-20
Last Modified: 2025-10-20

==============================================================================
Description
    - AI 비전 카메라 모듈을 통한 실시간 모니터링 python 코드 
    - 작성 중...

==============================================================================
Instruction
    - 동작 작동 함수:
        - 

==============================================================================
Note:
    - 

==============================================================================
"""

from PetoiRobot import * # 기본 동작 정의 library

import time
import math
import random

# 자동으로 포트 연결하기 
#    포트 정의하지 않아도 모든 포트 접근 -> 연결된 Petoi 포트로 연결됨
autoConnect()

# Gyro 비활성화 
#    동작 작동 시 방해받을 수 있음
# deacGyro()

# ==============================================================================
# AI 비전 카메라 예제


# ==============================================================================
# 대기 상태
time.sleep(1) # 초 단위

# ==============================================================================
# 포트 닫기
closePort()




# ==============================================================================
# 관련 함수 참고 
# PetoiRobot/robot.py

