"""
==============================================================================
Project: petoi basic code

File: n03_speaker_demo.py
Summary: 스피커 출력 예제
Author: 유도연
Created Date: 2025-10-16
Last Modified: 2025-10-16

==============================================================================
Description
    - tone, mp3 출력 python 코드

==============================================================================
Instruction
    - 동작 작동 함수:
        - play('b', absValList(계이름 인덱스, 동작 시간), 동작 시간)
            - absValList 대신 list 형태 그대로 넣어줘도 됨 [계이름 인덱스, 동작 시간, 계이름 인덱스, 동작 시간, ...]

==============================================================================
계이름 인덱스 목록
    - C, D, E, F, G, A, B (1, 2) 
    - C1: 10
    - D1: 12
    - E1: 14
    - F1: 15
    - G1: 17
    - A1: 19
    - B1: 21
    - C2: 22
    - D2: 24
    - E2: 26
    - F2: 27
    - G2: 29
    - A2: 31
    - B2: 33

==============================================================================
"""

from PetoiRobot import * # 기본 동작 정의 library

# 자동으로 포트 연결하기 
#    포트 정의하지 않아도 모든 포트 접근 -> 연결된 Petoi 포트로 연결됨
autoConnect()

# ==============================================================================
# 스피커 출력 예제

play('b', absValList(10, 2), 1) # C1 = 도
play('b', absValList(12, 2), 1) # D1 = 레
play('b', absValList(14, 2), 1) # E1 = 미

# ==============================================================================
# absValList 대신 list 형태 그대로 넣어주기
#    The list format is [note, duration, note, duration...]
play('b', [14,4,14,4,21,4,21,4,23,4,23,4,21,2], 1) # 반짝 반짝 작은별

# ==============================================================================
# 부저 출력 예제 (MindPlus)
# for index in range(5):
#     writeAnalogValue(25, 120)
#     writeAnalogValue(25, 0)
#     time.sleep(1)

# ==============================================================================
# mp3. wav 출력 예제
# OpenCatESP32/Module test / testMP3.py 참조

# ==============================================================================
# 대기 상태
time.sleep(1) # 초 단위

# ==============================================================================
# 포트 닫기
closePort()




# ==============================================================================
# 관련 함수 참고 
# PetoiRobot/robot.py

# # play tones
# def play(token, var, delayTime):
#     newList = []

#     for iA in var:
#         if isinstance(iA, int):
#             newList += [iA]
#         elif isinstance(iA, tuple):
#             newList += [iA[0], iA[1]]
#     sendLongCmd(token, newList, delayTime)


# # creat an absolut value list
# def absValList(num1, num2):
#     return [(int(num1), num2)]